app/controllers/books_controller.rb

INSERT INTO "books" ("title", "author", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "1984"], ["author", "George Orwell"], ["created_at", "2025-04-20 03:38:05.314888"], ["updated_at", "2025-04-20 03:38:05.314888"]]
---
    def create
      book = Book.new(book_params)
      if book.save